Revit 2027 API
FamilyElementVisibility.IsShownInFrontBack Property
Indicates if the instance is display in Front/Back view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShownInFrontBack { get; set; }
Public Property IsShownInFrontBack As Boolean
	Get
	Set
public:
property bool IsShownInFrontBack {
	bool get ();
	void set (bool value);
}
member IsShownInFrontBack : bool with get, set
Property Value
Boolean
Remarks
This property matters for objects whose visibility type is Model.
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace